app/controllers/celebs_controller.rb

SELECT "celebs".* FROM "celebs" WHERE "celebs"."name" ILIKE '%Travis Scott%'
SELECT "celebs".* FROM "celebs" WHERE ("celebs"."name" ILIKE '%Felix Hermann%' AND "celebs"."date" ILIKE '2020-11-24')
---
    def index
      if params[:search_by_name_and_date].nil? || params[:search_by_name_and_date].empty?
        @celebs = Celeb.all.order(name: :desc)
      else
        @celebs = Celeb.search_by_title_and_location(params[:search_by_name_and_date]).order(name: :desc)

INSERT INTO "celebs" ("name", "date", "created_at", "updated_at", "description", "shop_title", "description_link2", "description_link3", "description_link4", "description_link5", "description_link6", "description_link7", "description_link8", "title_link2", "title_link3", "title_link4", "title_link5", "title_link6", "title_link7", "title_link8") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
    def create

    @celeb = Celeb.new(celeb_params)

      if @celeb.save

SELECT "celebs".* FROM "celebs" WHERE "celebs"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def set_celeb
    @celeb = Celeb.find(params[:id])